final List<Map<String, dynamic>> banglaQuestions = [
  {
    "question": "বাংলাদেশের জাতীয় কবি কে?",
    "options": [
      "কাজী নজরুল ইসলাম",
      "রবীন্দ্রনাথ ঠাকুর",
      "জসীমউদ্দীন",
      "সুকান্ত ভট্টাচার্য"
    ],
    "answer": "কাজী নজরুল ইসলাম"
  },
  {
    "question": "বাংলা ভাষার প্রথম ব্যাকরণ রচয়িতা কে?",
    "options": [
      "মানোয়েল দ্য আসসুম্পসাঁও",
      "ঈশ্বরচন্দ্র বিদ্যাসাগর",
      "বঙ্কিমচন্দ্র চট্টোপাধ্যায়",
      "মাইকেল মধুসূদন দত্ত"
    ],
    "answer": "মানোয়েল দ্য আসসুম্পসাঁও"
  },
  {
    "question": "বাংলা সাহিত্যের প্রথম সার্থক উপন্যাস কোনটি?",
    "options": [
      "দুর্গেশনন্দিনী",
      "পথের পাঁচালী",
      "বিষবৃক্ষ",
      "কপালকুণ্ডলা"
    ],
    "answer": "দুর্গেশনন্দিনী"
  },
  {
    "question": "‘সোনার তরী’ কাব্যের রচয়িতা কে?",
    "options": [
      "রবীন্দ্রনাথ ঠাকুর",
      "কাজী নজরুল ইসলাম",
      "জীবনানন্দ দাশ",
      "শরৎচন্দ্র চট্টোপাধ্যায়"
    ],
    "answer": "রবীন্দ্রনাথ ঠাকুর"
  },
  {
    "question": "‘বিদ্রোহী’ কবিতার কবি কে?",
    "options": [
      "কাজী নজরুল ইসলাম",
      "রবীন্দ্রনাথ ঠাকুর",
      "জীবনানন্দ দাশ",
      "সুকান্ত ভট্টাচার্য"
    ],
    "answer": "কাজী নজরুল ইসলাম"
  }
];
