final List<Map<String, dynamic>> gkQuestions = [
  {
    "question": "বাংলাদেশের রাজধানী কী?",
    "options": ["ঢাকা", "চট্টগ্রাম", "রাজশাহী", "খুলনা"],
    "answer": "ঢাকা"
  },
  {
    "question": "বাংলাদেশের জাতীয় ফুল কোনটি?",
    "options": ["গোলাপ", "শাপলা", "জবা", "বেলি"],
    "answer": "শাপলা"
  },
  {
    "question": "বাংলাদেশের জাতীয় ফল কোনটি?",
    "options": ["আম", "কাঁঠাল", "লিচু", "কলা"],
    "answer": "কাঁঠাল"
  },
  {
    "question": "বাংলাদেশের জাতীয় পাখি কোনটি?",
    "options": ["দোয়েল", "কাক", "ময়ূর", "শালিক"],
    "answer": "দোয়েল"
  },
  {
    "question": "পৃথিবীর সবচেয়ে বড় মহাদেশ কোনটি?",
    "options": ["আফ্রিকা", "ইউরোপ", "এশিয়া", "অস্ট্রেলিয়া"],
    "answer": "এশিয়া"
  },
  {
    "question": "পৃথিবীর সবচেয়ে বড় মহাসাগর কোনটি?",
    "options": [
      "আটলান্টিক মহাসাগর",
      "প্রশান্ত মহাসাগর",
      "ভারত মহাসাগর",
      "আর্কটিক মহাসাগর"
    ],
    "answer": "প্রশান্ত মহাসাগর"
  },
  {
    "question": "জাতিসংঘের সদর দপ্তর কোথায়?",
    "options": ["লন্ডন", "নিউ ইয়র্ক", "প্যারিস", "জেনেভা"],
    "answer": "নিউ ইয়র্ক"
  },
  {
    "question": "জাপানের রাজধানী কী?",
    "options": ["ওসাকা", "টোকিও", "কিয়োটো", "নাগোয়া"],
    "answer": "টোকিও"
  },
  {
    "question": "ভারতের রাজধানী কী?",
    "options": ["মুম্বাই", "কলকাতা", "নয়াদিল্লি", "চেন্নাই"],
    "answer": "নয়াদিল্লি"
  },
  {
    "question": "সৌরজগতের বৃহত্তম গ্রহ কোনটি?",
    "options": ["পৃথিবী", "শনি", "বৃহস্পতি", "মঙ্গল"],
    "answer": "বৃহস্পতি"
  }
];
